//
// Created by 左手工匠 on 2019/2/16.
//

#include "Game.h"
#include "GameLib.h"

#define SEP "------------------------------------------------------------------------------"
#define COL 78      //游戏的界面的总宽度
#define MAXGIN_X 20 //游戏界面与控制台的左边距

Map mapArray[8][8] = {
        {
                {1, "天山", 20, {0, 0}, "举目眺望, 尽是飞雪"},
                {2, "地山", 20, {0, 0}, "举目眺望, 尽是飞雪"},
                {3, "太空", 20, {0, 0}, "举目眺望, 尽是飞雪"},
                {4, "虚空", 20, {0, 0}, "举目眺望, 尽是飞雪"},
                {5, "嵩山", 20, {0, 0}, "举目眺望, 尽是飞雪"},
                {6, "峨眉山", 20, {0, 0}, "举目眺望, 尽是飞雪"},
                {7, "天山", 20, {0, 0}, "举目眺望, 尽是飞雪"},
                {8, "天山", 20, {0, 0}, "举目眺望, 尽是飞雪"},
        },
        {
                {9, "野猪寨", 20, {0, 0}, "举目眺望, 尽是飞雪"},
                {10, "天山", 20, {0, 0}, "举目眺望, 尽是飞雪"},
                {11, "天山", 20, {0, 0}, "举目眺望, 尽是飞雪"},
                {12, "天山", 20, {0, 0}, "举目眺望, 尽是飞雪"},
                {13, "天山", 20, {0, 0}, "举目眺望, 尽是飞雪"},
                {14, "天山", 20, {0, 0}, "举目眺望, 尽是飞雪"},
                {15, "天山", 20, {0, 0}, "举目眺望, 尽是飞雪"},
                {16, "天山", 20, {0, 0}, "举目眺望, 尽是飞雪"},
        },
        {
                {17, "天山", 20, {0, 0}, "举目眺望, 尽是飞雪"},
                {18, "天山", 20, {0, 0}, "举目眺望, 尽是飞雪"},
                {19, "天山", 20, {0, 0}, "举目眺望, 尽是飞雪"},
                {20, "天山", 20, {0, 0}, "举目眺望, 尽是飞雪"},
                {21, "天山", 20, {0, 0}, "举目眺望, 尽是飞雪"},
                {22, "天山", 20, {0, 0}, "举目眺望, 尽是飞雪"},
                {23, "天山", 20, {0, 0}, "举目眺望, 尽是飞雪"},
                {24, "天山", 20, {0, 0}, "举目眺望, 尽是飞雪"},
        },
        {
                {25, "天山", 20, {0, 0}, "举目眺望, 尽是飞雪"},
                {26, "天山", 20, {0, 0}, "举目眺望, 尽是飞雪"},
                {27, "天山", 20, {0, 0}, "举目眺望, 尽是飞雪"},
                {28, "天山", 20, {0, 0}, "举目眺望, 尽是飞雪"},
                {29, "天山", 20, {0, 0}, "举目眺望, 尽是飞雪"},
                {30, "天山", 20, {0, 0}, "举目眺望, 尽是飞雪"},
                {31, "天山", 20, {0, 0}, "举目眺望, 尽是飞雪"},
                {32, "天山", 20, {0, 0}, "举目眺望, 尽是飞雪"},
        },
        {
                {1, "天山", 20, {0, 0}, "举目眺望, 尽是飞雪"},
                {2, "地山", 20, {0, 0}, "举目眺望, 尽是飞雪"},
                {3, "太空", 20, {0, 0}, "举目眺望, 尽是飞雪"},
                {4, "虚空", 20, {0, 0}, "举目眺望, 尽是飞雪"},
                {5, "嵩山", 20, {0, 0}, "举目眺望, 尽是飞雪"},
                {6, "峨眉山", 20, {0, 0}, "举目眺望, 尽是飞雪"},
                {7, "天山", 20, {0, 0}, "举目眺望, 尽是飞雪"},
                {8, "天山", 20, {0, 0}, "举目眺望, 尽是飞雪"},
        },
        {
                {9, "野猪寨", 20, {0, 0}, "举目眺望, 尽是飞雪"},
                {10, "天山", 20, {0, 0}, "举目眺望, 尽是飞雪"},
                {11, "天山", 20, {0, 0}, "举目眺望, 尽是飞雪"},
                {12, "天山", 20, {0, 0}, "举目眺望, 尽是飞雪"},
                {13, "天山", 20, {0, 0}, "举目眺望, 尽是飞雪"},
                {14, "天山", 20, {0, 0}, "举目眺望, 尽是飞雪"},
                {15, "天山", 20, {0, 0}, "举目眺望, 尽是飞雪"},
                {16, "天山", 20, {0, 0}, "举目眺望, 尽是飞雪"},
        },
        {
                {17, "天山", 20, {0, 0}, "举目眺望, 尽是飞雪"},
                {18, "天山", 20, {0, 0}, "举目眺望, 尽是飞雪"},
                {19, "天山", 20, {0, 0}, "举目眺望, 尽是飞雪"},
                {20, "天山", 20, {0, 0}, "举目眺望, 尽是飞雪"},
                {21, "天山", 20, {0, 0}, "举目眺望, 尽是飞雪"},
                {22, "天山", 20, {0, 0}, "举目眺望, 尽是飞雪"},
                {23, "天山", 20, {0, 0}, "举目眺望, 尽是飞雪"},
                {24, "天山", 20, {0, 0}, "举目眺望, 尽是飞雪"},
        },
        {
                {25, "天山", 20, {0, 0}, "举目眺望, 尽是飞雪"},
                {26, "天山", 20, {0, 0}, "举目眺望, 尽是飞雪"},
                {27, "天山", 20, {0, 0}, "举目眺望, 尽是飞雪"},
                {28, "天山", 20, {0, 0}, "举目眺望, 尽是飞雪"},
                {29, "天山", 20, {0, 0}, "举目眺望, 尽是飞雪"},
                {30, "天山", 20, {0, 0}, "举目眺望, 尽是飞雪"},
                {31, "天山", 20, {0, 0}, "举目眺望, 尽是飞雪"},
                {32, "天山", 20, {0, 0}, "举目眺望, 尽是飞雪"},
        },
};//八个一维数组分别使用{}的原因为编译器对维度产生了混淆, 导致打印地图只有第一个一维数组!!!

Prop propArray[] = {
        {1, "嵩阳古剑" ,1000, 1, Weapon, 50, .minAttack = 16, .maxAttack = 22, "剑是老了点，可砍起人来一点都不含糊。实在不想用，当古董卖好了!"},
        {2, "形意六合棍", 2000, 2, Weapon, 40, .minAttack = 30, .maxAttack = 38, "虽然名为“六合”，可传说中的高手却能用它使出八种猛兽的形态，你呢？"},
        {3, "暴雨梨花针", 5000, 3, Weapon, 35, .minAttack = 55, .maxAttack = 78, "出必见血，空回不祥，急中之急，暗器之王！气死人了，这暴风骤雨般的梨花针怎么躲得开嘛！难道非逼人穿“防弹背心”不成？"},
        {4, "踏月襟", 20000, 7, Armor, 10, .minDefence = 28, .maxDefence = 34, "举头望月, 看到了吗, 那就是月亮的力量啊, 化月光之力为我挡伤害!"},
        {5, "斩霜金轮", 50000, 9, Armor, 3, .minDefence = 1688, .maxDefence = 1982, "神秘的光晕, 一圈圈的涟漪在金轮荡漾, 谁也不知道它从何而来, 但它的光辉无人能侵!"},
        {6, "金创药", 2000, 3, Con, 50, .minPower = 500, .maxPower = 600, "金创药，俗称刀尖药，其实是一种药的商用名，比如，跌打药，专治跌打损伤, 少侠可要来一份"},
        {7, "真气丸", 2500, 4, Con, 50, .minPower = 500, .maxPower = 600, "燃烧内力, 迅速补充全身能量, 打开你的三万六千个毛孔, 以汲取天地日月精华!"},
        {8, "穿云裂石戟", 45000, 8, Weapon, 5, .minAttack = 1500, .maxAttack = 1800, "在海中呆了一万年的它，很可能并非地球之物。劝你小心保管，说不定哪天外星人从天而降，把此戟收回可就太不划算了！"},
        {9, "八宝玲珑枪", 50000, 9, Weapon, 3, .minAttack = 2488, .maxAttack = 3244, "枪身镶有八种宝物。拥有此枪之人，可以说拥有了一笔不小的财富！"},
};

void PropInit() {

}

/** 打印道具类数据 */
void Show() {
    //打印道具
    int propCount = sizeof(propArray) / sizeof(propArray[0]);
    for(int i = 0; i < propCount; i++) {
        printf("%-8d%-18s%-6.0f\n", propArray[i].id, propArray[i].name, propArray[i].price);
    }
    printf("\n");
    //打印地图
    for (int i = 0; i < 8; i++) {
        for(int j = 0; j < 8; j++) {
            printf("%-8s", mapArray[i][j].name);
        }
        printf("\n");
    }

}
    /** 显示欢迎信息 */
void ShowWelcome() {
    SetPosition(MAXGIN_X, 0);
    printf("%s", SEP);
    SetPosition(MAXGIN_X, 1);
    printf("|");
    SetPosition(MAXGIN_X + 25, 1);
    printf("欢迎来到笑傲江湖的世界");
    SetPosition(MAXGIN_X + 77, 1);
    printf("|");
    SetPosition(MAXGIN_X, 2);
    printf("%s", SEP);
}

    /** 显示游戏地图 */
    void ShowMap() {
        printf("%s\n", SEP);
    }

    /** 显示游戏下方的信息面板 */
    void ShowInformation() {

    }

    /** 显示游戏的主菜单 */
    void ShowMainMenu() {

    }
